testdata/IN_2023_02/Roundtrip/produkt/risiko/drv/20210802_drv_endalter_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dol="urn:de:vb:bipro:taa:dol:1.12" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          
      <tarif:Request>
                
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
                
        <tarif:Tarifierung>
                      
          <gevo:Vermittler>
                            
            <allg:Vermittlernummer>111/222</allg:Vermittlernummer>
                            
            <allg:PartnerID>0</allg:PartnerID>
                            
            <allg:IHKRegistrierungsnummer>0-1234-56789-AB</allg:IHKRegistrierungsnummer>
                        
          </gevo:Vermittler>
                      
          <tarif:Partner xsi:type="partner:CT_Person">
                            
            <partner:Anrede>1</partner:Anrede>
                            
            <partner:PartnerID>1</partner:PartnerID>
                            
            <partner:ZusaetzlichePartnerdaten xsi:type="pm-leben:CT_Risiko">
                                  
              <basis:Erweiterung xsi:type="vbl:CT_RisikoErweiterung">
                                        
                <vbl:Raucherstatus>NichtraucherMind10Jahre</vbl:Raucherstatus>
                                    
              </basis:Erweiterung>
                                  
              <pm-leben:Koerper>
                                        
                <partner:Groesse>180</partner:Groesse>
                                        
                <partner:Gewicht>75</partner:Gewicht>
                                    
              </pm-leben:Koerper>
                              
            </partner:ZusaetzlichePartnerdaten>
                            
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                            
            <partner:Geschlecht>1</partner:Geschlecht>
                            
            <partner:Staatsangehoerigkeit>D</partner:Staatsangehoerigkeit>
                            
            <partner:Berufstaetigkeit>
                                  
              <partner:Beruf>Koch</partner:Beruf>
                              
            </partner:Berufstaetigkeit>
                        
          </tarif:Partner>
                      
          <tarif:Partner xsi:type="partner:CT_Person">
                            
            <partner:Anrede>2</partner:Anrede>
                            
            <partner:PartnerID>2</partner:PartnerID>
                            
            <partner:ZusaetzlichePartnerdaten xsi:type="pm-leben:CT_Risiko">
                                  
              <basis:Erweiterung xsi:type="vbl:CT_RisikoErweiterung">
                                        
                <vbl:Raucherstatus>Raucher</vbl:Raucherstatus>
                                    
              </basis:Erweiterung>
                                  
              <pm-leben:Koerper>
                                        
                <partner:Groesse>180</partner:Groesse>
                                        
                <partner:Gewicht>175</partner:Gewicht>
                                    
              </pm-leben:Koerper>
                              
            </partner:ZusaetzlichePartnerdaten>
                            
            <partner:Geburtsdatum>1980-02-02</partner:Geburtsdatum>
                            
            <partner:Geschlecht>2</partner:Geschlecht>
                            
            <partner:Staatsangehoerigkeit>D</partner:Staatsangehoerigkeit>
                            
            <partner:Berufstaetigkeit>
                                  
              <partner:Beruf>Köchin</partner:Beruf>
                              
            </partner:Berufstaetigkeit>
                        
          </tarif:Partner>
                      
          <tarif:Versicherungsnehmer>
                            
            <partner:PartnerID>1</partner:PartnerID>
                        
          </tarif:Versicherungsnehmer>
                      
          <tarif:Verkaufsprodukt>
                            
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                                  
              <basis:Erweiterung xsi:type="vbl:CT_ProduktErweiterung">
                                        
                <vbl:Tarifgruppe>Normal</vbl:Tarifgruppe>
                                    
              </basis:Erweiterung>
                                  
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                                  
              <pm:Beitrag>
                                        
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                        
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                                    
              </pm:Beitrag>
                                  
              <pm:Beitrag>
                                        
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">02</pm:ArtID>
                                        
                <pm:Betrag>
                                              
                  <allg:Betrag>50</allg:Betrag>
                                              
                  <allg:Waehrung>EUR</allg:Waehrung>
                                          
                </pm:Betrag>
                                        
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                                    
              </pm:Beitrag>
                                  
              <pm:Versicherungsdauer>
                                        
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                                    
              </pm:Versicherungsdauer>
                                  
              <pm:Paket xsi:type="dol:STE_PaketErweitert">B</pm:Paket>
                                  
              <pm:Kennung>DRV</pm:Kennung>
                                  
              <pm:Elementarprodukt xsi:type="pm-leben:CT_TodesfallAbsicherung">
                                        
                <basis:Erweiterung xsi:type="vbl:CT_TodesfallAbsicherungErweiterung">
                                              
                  <vbl:Monatsgenau>true</vbl:Monatsgenau>
                                              
                  <vbl:ArtRisikoabsicherung>Familie</vbl:ArtRisikoabsicherung>
                                          
                </basis:Erweiterung>
                                        
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                        
                <pm-leben:Produktattribut>51</pm-leben:Produktattribut>
                                        
                <pm-leben:Endalter>40</pm-leben:Endalter>
                                        
                <pm-leben:MitversichertePerson>
                                              
                  <partner:PartnerID>2</partner:PartnerID>
                                          
                </pm-leben:MitversichertePerson>
                                        
                <pm-leben:VersichertePerson>
                                              
                  <partner:PartnerID>1</partner:PartnerID>
                                          
                </pm-leben:VersichertePerson>
                                    
              </pm:Elementarprodukt>
                                  
              <pm-leben:VorgabeBerechnung>
                                        
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Nettobeitrag</pm-leben:ArtID>
                                        
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">Produkt</pm-leben:Kontext>
                                    
              </pm-leben:VorgabeBerechnung>
                              
            </pm:Produkt>
                        
          </tarif:Verkaufsprodukt>
                  
        </tarif:Tarifierung>
            
      </tarif:Request>
      
    </tarif:getQuote>
  </soapenv:Body>
</soapenv:Envelope>
